app/controllers/trip_route_activities_controller.rb

  def create
    @trip_route = TripRoute.find params[:trip_route_id]
    @trip_route_activity = @trip_route.trip_route_activities.create trip_route_activity_params
---
SELECT  "trip_routes".* FROM "trip_routes" WHERE "trip_routes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "trip_route_activities" ("trip_route_id", "activity_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["trip_route_id", 16], ["activity_id", 2], ["created_at", 2017-03-02 09:10:29 UTC], ["updated_at", 2017-03-02 09:10:29 UTC]]