app/controllers/trip_routes_controller.rb

  def show
    @trip_route = TripRoute.find params[:id]
    @trip_route_activity = TripRouteActivity.new
    @trip_route_activities = @trip_route.trip_route_activities
    @hash = Gmaps4rails.build_markers(@trip_route_activities) do |trip_route, marker|
      marker.lat trip_route.activity.latitude
      marker.lng trip_route.activity.longitude
      marker.infowindow trip_route.activity.title.capitalize
    end

    if @trip_route.address.present?
---
SELECT  "trip_routes".* FROM "trip_routes" WHERE "trip_routes"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "trip_route_activities".* FROM "trip_route_activities" WHERE "trip_route_activities"."trip_route_id" = $1  [["trip_route_id", 10]]

  def new
    @trip_route = TripRoute.new
    @activities = Activity.all
---
SELECT "activities".* FROM "activities"

  def create
    @trip_route = TripRoute.new trip_route_params

    if @trip_route.save
---
INSERT INTO "trip_routes" ("transport", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["transport", 0], ["user_id", 1], ["created_at", 2017-02-24 13:32:35 UTC], ["updated_at", 2017-02-24 13:32:35 UTC]]