app/controllers/users_controller.rb

  def show
    @trip_route = TripRoute.new
    @trip_routes = @user.trip_routes.by_date.paginate(:page => params[:page], :per_page => 20)
    @images = @user.activity_images.paginate(:page => params[:page], :per_page => 8)
---
SELECT "trip_routes".* FROM "trip_routes" WHERE "trip_routes"."user_id" IS NULL
SELECT "activities".* FROM "activities"